app/controllers/api/drivers_controller.rb

    def set_driver
      @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = 1 LIMIT 1