app/controllers/drivers_controller.rb

INSERT INTO "drivers" ("name", "latitude", "longitude", "status", "user_id", "created_at", "updated_at") VALUES ('bucky', NULL, NULL, 'offline', 1, '2025-12-05 00:42:50.139448', '2025-12-05 00:42:50.139448') RETURNING "id"
---
  def create
    @driver = current_user.drivers.build(driver_params)

    if @driver.save

UPDATE "drivers" SET "status" = 'active', "updated_at" = '2025-12-05 00:43:12.041775' WHERE "drivers"."id" = 1
---
  def update
    if @driver.update(driver_params)

SELECT "drivers".* FROM "drivers" WHERE "drivers"."user_id" = 1 AND "drivers"."id" = 1 LIMIT 1
---
  def set_driver
    @driver = current_user.drivers.find(params[:id])