app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'brett.thomas29.97@gmail.com' LIMIT 1
---
  def create
    email = params[:email] || params[:email_address]
    if user = User.find_by(email: email)&.authenticate(params[:password])