app/controllers/shipments_controller.rb

SELECT "shipments".* FROM "shipments" WHERE "shipments"."status" IN (0, 1) ORDER BY "shipments"."created_at" DESC
---
  def index
  @shipments = Shipment.where(status: [0,1]).order(created_at: :desc) # Active shipments